Repository: diegodlh/jamulus-es
Catalog: Recursos_OmegaT/jamulus-omegat.tmx
Source language: en_gb
Languages: es_es

source: As of Jamulus 3.5.4 THIS PAGE IS OUT OF DATE.
es_es: A partir de Jamulus 3.5.4 ESTA PÁGINA SE HA QUEDADO OBSOLETA.

source: For current releases, please refer to server instructions here.
es_es: Para versiones actuales, por favor consulta las instrucciones para el servidor aquí.

source: Following instructions are for Jamulus <= 3.5.3
es_es: Las siguientes instrucciones son para Jamulus <= 3.5.3

source: After installing Jamulus, you can run it in your chosen server mode using the Terminal program to call Jamulus with the -s option as follows:
es_es: Tras instalar Jamulus, puedes ejecutarlo en el modo de servidor que elijas, utilizando la Terminal para abrir Jamulus con la opción -s como sigue:

source: First, quit Jamulus if it is already running.
es_es: Primero, cierra Jamulus si está en marcha.

source: Start a Terminal session.
es_es: Empieza una sesión en la Terminal.

source: You will need to know the full path to the Jamulus application (example below) so that you can run the following command. It must be all on one line:
es_es: Necesitarás saber la ruta completa a la aplicación de Jamulus (ejemplo abajo) para que puedas ejecutar el comando siguiente. Tiene que ser todo en una única línea:

source: If you are running a server, test by starting with the --server option, and watch GUI on VNC (or HDMI). When running as a client, you should see the GUI start.
es_es: Si estás ejecutando un servidor, pruébalo arrancándolo con la opción --server y visualiza la interfaz gráfica mediante VNC (o HDMI). Cuando lo ejecutas como cliente, deberías de ver abrirse la interfaz gráfica.

source: If all is well, run in your chosen server mode as follows (or use systemd unit script provided in the Linux guide), for example a public server:
es_es: Si todo ha ido bien, ejecuta en el modo de servidor escogido como sigue (o utiliza el script de unidad de systemd proporcionado en la guía para Linux); por ejemplo un servidor público:

source: sudo chrt 99 ionice -c1 nice -n -20 Jamulus -s -n -e [yourCentralServer] -o "yourServerName;yourCity;[country ID]"&
es_es: sudo chrt 99 ionice -c1 nice -n -20 Jamulus -s -n -e [tuServidorCentral] -o "nombreDeTuServidor;tuCiudad;[ID país]"&

source: Please also see this important note on Central Servers.
es_es: También consulta esta nota importante sobre los servidores centrales.

source: To upgrade Jamulus
es_es: Para actualizar Jamulus

source: Stop the server and simply repeat step 3 for obtaining the sources and installing above.
es_es: Cierra el servidor y simplemente repite el paso 3 de arriba para obtener las fuentes y hacer la instalación.

source: If you want to install a specific release, you can do the following using git (where [RELEASE] is a release ID such as r3_5_8). See the official tagged releases.
es_es: Si quieres instalar una versión concreta, puedes hacer lo siguiente usando git (donde [VERSIÓN] es el código de la versión como r3_5_8). Ver las versiones oficiales.

source: First, cd inside the directory in which the Jamulus sources were unpacked/downloaded, then use the following commands:
es_es: Primero, cd al directorio donde se descomprimieron/descargaron las fuentes de Jamulus, y luego usa estos comandos:

source: Home \> Running a Server \> Installing on Raspberry Pi
es_es: Inicio \> Ejecutar un Servidor \> Instalación en Raspberry Pi

source: git pull git checkout [RELEASE]
es_es: git pull git checkout [VERSIÓN]

source: Then compile the sources as per a new install. Start Jamulus back up.
es_es: Luego compila las fuentes como con una instalación nueva. Arranca Jamulus de nuevo.

source: Jamulus has been tested on a Raspberry Pi 4 2Gb by Jamulus user SIVA Frédéric
es_es: Jamulus ha sido testado en un Raspberry Pi 4 2Gb por el usuario de Jamulus SIVA Frédéric

source: Install Raspbian Buster (allow VNC and SSH for comfort, but will ultimately run without VNC for higher speed)
es_es: Instala Raspbian Buster (permite VNC y SSH para mayor comodidad, pero en última instancia se ejecutará sin VNC para mayor velocidad)

source: Edit config.txt to enable boot without HDMI by adding hdmi_force_hotplug=0
es_es: Edita config.txt para habilitar el arranque sin HDMI añadiendo hdmi_force_hotplug=0

source: Get the sources, install the dependent packages according to the Linux client install guide but do NOT install Jack package(s) - you don't need them on a headless server. To run a client, install all listed dependencies.
es_es: Obtén las fuentes, instala las dependencias de acuerdo a la guía de instalación de Linux pero NO instales los paquetes de Jack - no los necesitas en un servidor headless. Para ejecutar un cliente, instala todas las dependencias listadas.

source: Compile the source code for a server as per these instructions. Compile a client using the default instructions.
es_es: Compila el código fuente para un servidor de acuerdo a estas instrucciones. Compila un cliente utilizando las instrucciones predeterminadas.

source: This will build Jamulus and put it in /usr/local/bin/Jamulus
es_es: Esto compilará Jamulus y lo instalará en /usr/local/bin/Jamulus

source: Connect Raspberry Pi with Ethernet cable to your router.
es_es: Conecta el Raspberry Pi con un cable Ethernet a tu router.

source: The Chat Welcome Message appears to all users when they join the server (the chat window will open automatically for them).
es_es: La ventana del Mensaje de Bienvenida aparece a todos los usuarios cuando se conectan al servidor (para ellos se abrirá la ventana automáticamente)

source: Private server setup
es_es: Configuración de servidor privado

source: If you do not check the "Make My Server Public", you will be running a private server and need to read these instructions.
es_es: Si no quieres activar "Mi Servidor es Público", estarás ejecutando un servidor privado y debes leer estas instrucciones.

source: If you want to run a client on the same machine you should connect the client to 127.0.0.1 for best performance. (Similarly, if you want to connect a client on another machine on your LAN, use the server's LAN IP address).
es_es: Si quieres ejecutar un cliente en la misma máquina tienes que conectar el cliente a 127.0.0.1 para un rendimiento óptimo. (Similarmente, si quieres conectar un cliente en otra máquina de tu red local, utiliza la dirección IP de red local del servidor).

source: Recording
es_es: Grabación

source: Turn on server recording by first setting the Recording Directory in the Options tab. Recording starts once the first person connects to the server, and stops when the last person leaves. Use the "New Recording" button to create a new sub-directory in which the recordings will be stored. Note that Recordings are per track in Audacity .lof format and REAPER .rpp. Open the respective files to listen to them in those applications.
es_es: Primero activa la grabación por parte del servidor estableciendo el Directorio de Grabación en la pestaña de Opciones. La grabación comienza cuando la primera persona se conecta al servidor y se para cuando la última persona se marcha. Utiliza el botón de "Nueva Grabación" para crear un nuevo sub-directorio en el cual se guardarán las grabaciones. Nota: las grabaciones son por pistas en el formato .lof de Audacity y .rpp de REAPER. Abre los archivos respectivos para escucharlos en estas aplicaciones.

source: Other options
es_es: Otras opciones

source: If you show a Creative Commons licence, users will be unable to join the server until they agree to it.
es_es: Si muestras una licencia Creative Commons, los usuarios no podrán conectarse al servidor hasta que lo acepten.

source: Windows users - If you want the server to start automatically on system start, enable the corresponding check box.
es_es: Usuarios de Windows - Si quieres que el servidor arranque automáticamente al iniciar el sistema, activa la casilla correspondiente.

source: (Leave the "Custom Central Server Address" field empty unless you need to list your server on a private central server)
es_es: (Deja el campo de "Dirección Personalizada Servidor Central" vacío a menos que necesites listar tu servidor en un servidor central privado)

source: Home \> Running a Server \> Getting started
es_es: Inicio \> Ejecutar un Servidor \> Cómo empezar

source: Windows users - Start the server using the entry for "Jamulus server" in the Windows start menu.
es_es: Usuarios de Windows - Arranca el servidor utilizando la entrada de "Jamulus server" en el menú de inicio de Windows.

source: Macintosh users - Double-click the "Jamulus server" icon in Applications (assuming you put the files from the install there as per these instructions).
es_es: Usuarios de Macintosh - Haz doble cilc en el icono de "Jamulus server" en Aplicaciones (suponiendo que has depositado los archivos allí siguiendo estas instrucciones).

source: Linux users - Please refer to the GUI server instructions.
es_es: Usuarios de Linux - Consulta las instrucciones para el servidor con interfaz gráfica.

source: Public server setup
es_es: Configuración de servidor público

source: On checking "Make My Server Public" you should see a confirmation message saying whether your server has registered successfully.
es_es: Al activar "Mi Servidor es Público" deberías ver un mensaje de confirmación de que tu servidor se ha registrado correctamente.

source: Type in the name, city and country so that other users can easily identify you.
es_es: Escribe el nombre, la ciudad y el país para que otros usuarios puedan identificarte con facilidad.

source: Specify a musical genre if you wish. This will make your server appear in the relevant server list for clients (see more details on Central Servers).
es_es: Especifica un género musical si quieres. Esto hará que tu servidor aparezca en la lista relevante para los clientes (ver más detalles sobre los Servidores Centrales).

source: What address do I give to people so that they can connect to my server?
es_es: ¿Qué dirección debo dar a la gente para que se conecten a mi servidor?

source: This should be your public IP address (find that with Google). Connect your own Jamulus client to your local IP address. Note that your public IP address can change - see the note on "dynamic DNS" in this guide.
es_es: Tiene que ser tu dirección IP pública (encuéntralo con Google). Conecta tu propio cliente Jamulus utilizando tu dirección IP local. Ten en cuenta que tu dirección IP pública puede cambiar - ver la nota sobre "DNS dinámica" en esta guía.

source: What port numbers can I use?
es_es: ¿Qué números de puerto puedo utilizar?

source: Keep the default UDP ports. The actual default port is documented by the command line. At the time of writing this documentation, the port number is 22124.
es_es: Utiliza los puertos UDP predeterminados. El puerto predeterminado en concreto está documentado por la línea de comandos. En el momento de escribir esta documentación el número del puerto es 22124.

source: Is a private server a direct server without contact to the Jamulus Central Server?
es_es: Un servidor privado ¿es un servidor directo, sin contacto con el Servidor Central de Jamulus?

source: Yes. Please see Server Types
es_es: Sí. Lee sobre Tipos de Servidor

source: Can I convert my private server to being a public one?
es_es: ¿Puedo convertir mi servidor privado en uno público?

source: Yes. Simply check the "Make my Server Public" box in the server window and fill out the details. Remember that you also do not need to port forward if you have a public server.
es_es: Sí. Simplemente activa la casilla de "Mi Servidor es Público" en la ventana del servidor y rellena los datos. Recuerda que tampoco tienes por qué validar puertos si tu servidor es público.

source: Headless Linux: I have created a server but it is joining the Central Server and I don't want it to.
es_es: Linux Headless: He creado un servidor pero se está registrando con el Servidor Central y no quiero que lo haga.

source: To enable a private server, do not use the --centralserver (-e) option when starting your server command line.
es_es: Para habilitar un servidor privado, no utilices la opción --centralserver (-e) cuando arranques tu servidor desde la línea de comandos.

source: Home \> Running a Server \> Troubleshooting FAQ
es_es: Inicio \> Ejecutar un Servidor \> FAQ Resolución de Problemas

source: Nobody can connect to my server - but I can connect locally
es_es: Nadie se puede conectar a mi servidor - pero yo me puedo conectar localmente

source: Some ISPs are using techniques like Address plus Port (A+P) or Carrier-grade NAT (CGN) to conserve address space. This makes it impossible to host services like Jamulus at home (and may mean you also cannot see server lists in your client, or you may be missing some specific servers).
es_es: Algunos operadores de internet utilizan técnicas como Address plus Port (A+P) o Carrier-grade NAT (CGN) para preservar espacios de direcciones. Esto hace que sea imposible ejecutar servicios como Jamulus en casa (y puede ocasionar que no veas listas de servidores en tu cliente o que te falten algunos servidores específicos).

source: To detect if CGN is the issue, go to your router's configuration screen (192.168.X.X) and look at the WAN Status page. If your listed IPv4 address does not match with the address you see here, then this CGN may be enabled. Or if you experience problems such as being unable to connect to servers or an empty server list this may also be an indicator that your ISP is the problem too.
es_es: Para detectar si el problema está causado por CGN, ve a la pantalla de configuración de tu router (192.168.X.X) y consulta la página de WAN Status. Si tu dirección listada de IPv4 no concuerda con la dirección que ves aquí, entonces puede que este CGN esté activado. O si experimentas problemas como no poder conectarte a servidores o una lista de servidores vacía esto también puede indicar que el problema reside en tu operador de internet.

source: To fix the issue: if you are running a public server, try port forwarding. If you are running a private server and are port forwarding already, contact your ISP support and request them to remove you from CGN and assign you a real WAN IP address because you want to host a server. If CGN is not the issue, you may need to ask your ISP to give you a WAN IP address (or fixed one to avoid using DDNS, if possible).
es_es: Para arreglar el problema: si estás ejecutando un servidor público, prueba la validación de puertos. Si estás ejecutando un servidor privado y ya has validado puertos, contacta con el soporte de tu operador y pide que te eliminen del CGN y te asignen una dirección WAN IP real porque quieres operar un servidor. Si el problema no es CGN, quizá tengas que pedir a tu operador que te asigne una dirección WAN IP (o una fija para evitar el uso de DDNS, si es posible).

source: Servers - Public
es_es: Servidores - Públicos

source: Why doesn't my server show up in the list? Why isn't in registering?
es_es: ¿Por qué no aparece mi servidor en la lista? ¿Por qué no se registra?

source: If you are registered OK (you can see it here) and you or your friends can't see your server, you may need to wait, or start your client with the --showallservers option and try connecting from there (see this page on how to start your client with a config option).
es_es: Si se ha registrado correctamente (lo puedes ver aquí) y tú o los demás músicos no pueden ver el servidor, quizá tengas que esperar, o iniciar el cliente con la opción --showallservers e intentar conectar desde ahí (ver esta página sobre cómo arrancar tu cliente con una opción de configuración).

source: If you are seeing a message that says the server is full, please see this note on Central Servers.
es_es: Si ves un mensaje diciendo que el servidor está completo, por favor lee esta nota sobre Servidores Centrales.

source: You can verify that your server is listed in the relevant genre by checking it here.
es_es: Puedes verificar que tu servidor aparece en la lista del género relevante comprobándolo aquí.

source: Servers - Private
es_es: Servidores - Privados

source: I'm running my client on the same machine/network as my server but I can't connect to it
es_es: Estoy ejecutando mi cliente en la misma máquina/red que mi servidor pero no me puedo conectar a él

source: Connect your client to 127.0.0.1 (or localhost if that works for you). If you're running the client on a different machine to the server but on the same network, then connect to the local network address of the server. Do not connect via the server's public (WAN) address.
es_es: Conecta tu cliente a 127.0.0.1 (o localhost si eso te funciona). Si estás ejecutando el cliente en una máquina distinta a la del servidor pero en la misma red, conéctate a la dirección de red local del servidor. No te conectes con la dirección pública (WAN) del servidor.

source: Home \> Running a Server \> Windows
es_es: Inicio \> Ejecutar un Servidor \> Windows

source: Please see this page.
es_es: Por favor consulta esta página.

source: Home \> Using Jamulus: You're outdated
es_es: Inicio \> Uso de Jamulus: Estás obsoleto

source: If you are reading this, your version of Jamulus needs to be updated.
es_es: Si estás leyendo esto, significa que tu versión de Jamulus necesita actualizarse.

source: Please use the download link below.
es_es: Por favor utiliza el enlace de descarga más abajo.

source: (The help page you requested has moved here)
es_es: (La página de ayuda que has solicitado ha sido movida aquí)

source: Audient EVO 4, driver download and install (USB Audio)
es_es: Audient EVO 4, descarga e instalación del driver (USB Audio)

source: Behringer UCA222 & UCA202 U-Control (USB audio) Note: Works best on Mac and Linux. On Windows, ASIO4ALL driver works OK but not great. There is also the native driver which Behringer withdrew support for a while ago, and therefore removed from their download section.
es_es: Behringer UCA222 & UCA202 U-Control (USB audio) Nota: Funciona mejor en Mac y Linux. En Windows, el driver ASIO4ALL funciona bien pero tampoco espectacular. También está el driver nativo para el cual Behringer retiró el soporte hace tiempo y por tanto retiró de su página de descargas.

source: Behringer UGC102 (USB interface for guitar/bass) Note: On Mac, appears as "USB Audio Codec" - when selected for input and output in Jamulus, the UGC102 headphone jack is the output (and cannot be used for input).
es_es: Behringer UGC102 (interfaz USB para guitarra/bajo) Nota: En Mac, aparece como "USB Audio Codec" - cuando se selecciona para entrada y salida en Jamulus, el puerto del auricular del UGC102 es la salida (y no se puede utilizar como entrada).

source: Behringer UMC202HD, UMC204HD, and UMC404HD interfaces, Windows 7 to 10 ASIO Driver (USB Audio)
es_es: Interfaces Behringer UMC202HD, UMC204HD, y UMC404HD, Windows 7 a 10 ASIO Driver (USB Audio)

source: Behringer X32 digital mixer with X-USB 32-in/32out (USB audio)
es_es: Mezcladora digital Behringer X32 con X-USB 32-entradas/32-salidas (USB audio)

source: Behringer XENYX Q502USB (USB audio) Behringer ASIO Driver
es_es: Behringer XENYX 302USB (USB audio) Behringer ASIO Driver

source: Behringer XENYX Q802USB (USB audio) Behringer ASIO Driver. This Behringer ASIO Driver does not appear to be very good. Audio latency with this 'unsupported' driver seems poor - not better than ASIO4all. It's good device for Mac and Linux, but perhaps not for Windows. More testing is required.
es_es: Behringer XENYX Q802USB (USB audio) Behringer ASIO Driver. Este driver ASIO de Behringer ASIO no parece ser muy bueno. La latencia con este driver 'no soportado' parece pobre - no es mejor que el ASIO4all. Es un buen dispositivo para Mac y Linux, pero quizá no tanto para Windows. Se precisarían más pruebas.

source: Behringer XR18/XR16/XR12 digital mixers (USB Audio)
es_es: Mezcladoras digitales Behringer XR18/XR16/XR12 (USB Audio)

source: Edirol FA-66 (Firewire) - good on Mac, Linux, and Windows ASIO driver
es_es: Edirol FA-66 (Firewire) - bueno en Mac, Linux, y Windows ASIO driver

source: Home \> Using Jamulus \> Hardware Setup \> Known good devices
es_es: Inicio \> Uso de Jamulus \> Configuración de Hardware \> Dispositivos funcionales

source: Focusrite Scarlett interfaces (USB Audio) Note: if you have issues with the buffer size going to 136 download the updated driver version 4.64.15.598 from http://beta.focusrite.com/
es_es: Interfaces Focusrite Scarlett (USB Audio) Nota: si tienes problemas con el buffer que se configura solo a 136, descarga la versión 4.64.15.598 actualizada del driver de http://beta.focusrite.com/

source: Focusrite Clarett 4Pre interface (Thunderbolt 2)
es_es: Interfaz Focusrite Clarett 4Pre (Thunderbolt 2)

source: HiFiBerry DAC +ADC (HAT). Virtually no jitters and the good latency (20 millseconds). No headphone amplifier, so you'll need one of those. I used a Rolls MX122 mini mixer. Tested using Raspberry Pi 4 running Raspberry Pi OS Buster, kernel version 4.19.
es_es: HiFiBerry DAC + ADC (HAT). Prácticamente sin jitter y buena latencia (20 milisegundos). No tiene amplificador de auriculares, así que necesitarás uno. Yo usé un Rolls MX122 mini mixer. Probado con Raspberry Pi 4 ejecutando Raspberry Pi OS Buster, versión de kernel 4.19.

source: iConnectivity AUDIO4+ interface (USB)
es_es: Interfaz iConnectivity AUDIO4+ (USB)

source: Lexicon Omega (USB audio) Note: Works best on Mac and Linux. There is a driver for Windows but this does not allow to use 64 samples buffer size and adds some latency compared to, e.g., the Mac driver.
es_es: Lexicon Omega (USB audio) Nota: Funciona mejor en Mac y Linux. Existe un driver para Windows pero no permite usar un tamaño de buffer de 64 y añade algo de latencia en comparación a, por ejemplo, el driver para Mac.

source: Line 6 Helix Stomp, read Remote Jamming with Helix and Jamulus for setup on a Mac. (USB Audio)
es_es: Line 6 Helix Stomp, lee Jams remotas con Helix y Jamulus para la configuración en Mac. (USB Audio)

source: MOTU Ultralite (2010 firewire model mk1/mk2), 2015 MacBook Pro, OS X El Capitan 10.11.6, Apple Thunderbolt/Firewire adapter.
es_es: MOTU Ultralite (modelo firewire 2010 mk1/mk2), 2015 MacBook Pro, OS X El Capitan 10.11.6, adaptador Apple Thunderbolt/Firewire.

source: Native Instruments Komplete Audio 2, Tested on Win10 with 64 sample buffer and am getting great sound and total latency around 15ms over the ping time. (USB Audio)
es_es: Native Instruments Komplete Audio 2, probado en Win10 con buffer de 64; sonido limpio y una latencia total de unos 15ms + tiempo ping. (USB Audio)

source: Soundblaster live with kX ASIO driver
es_es: Soundblaster live con driver kX ASIO

source: This page lists hardware known to work or not work with Jamulus (although it may vary between Windows, Mac and Linux). Please update with any new information you have (and indicate the platform(s) you have used).
es_es: Esta página contiene una lista de dispositivos de hardware que funciona o no funciona con Jamulus (aunque puede variar entre Windows, Mac y Linux). Por favor actualízala con cualquier información nueva que tengas (e indica la(s) platforma(s) que has utilizado).

source: Steinberg UR22C (USB3, USBC 32bits 192khz). Works directly on a Mac with a beautiful sound even with un-balanced jack. Works on a Raspberry PI4 provided jackd version used is the one from /usr/bin (Tweaking raspijamulus.sh). Not tested on PC.
es_es: Steinberg UR22C (USB3, USBC 32bits 192khz). Funciona directamente en Mac con sonido buenísimo incluso con jack sin balancear. Funciona en un Raspberry PI4 siempre que la versión de jackd sea la de /usr/bin (configurando raspijamulus.sh). No probado en PC.
